cduarte0306/RC-Car-peripheral-controller/src/rc-car-peripheral-controller/rc-car-peripheral-controller.cydsn/Generated_Source/PSoC5/TIME_COUNTER.h
/*******************************************************************************
* File Name: TIME_COUNTER.h
* Version 2.80
*
*  Description:
*     Contains the function prototypes and constants available to the timer
*     user module.
*
*   Note:
*     None
*
********************************************************************************
* Copyright 2008-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
********************************************************************************/

#if !defined(CY_TIMER_TIME_COUNTER_H)
#define CY_TIMER_TIME_COUNTER_H

#include "cytypes.h"
#include "cyfitter.h"
#include "CyLib.h" /* For CyEnterCriticalSection() and CyExitCriticalSection() functions */

extern uint8 TIME_COUNTER_initVar;

/* Check to see if required defines such as CY_PSOC5LP are available */
/* They are defined starting with cy_boot v3.0 */
#if !defined (CY_PSOC5LP)
    #error Component Timer_v2_80 requires cy_boot v3.0 or later
#endif /* (CY_ PSOC5LP) */


/**************************************
*           Parameter Defaults
**************************************/

#define TIME_COUNTER_Resolution                 32u
#define TIME_COUNTER_UsingFixedFunction         0u
#define TIME_COUNTER_UsingHWCaptureCounter      0u
#define TIME_COUNTER_SoftwareCaptureMode        0u
#define TIME_COUNTER_SoftwareTriggerMode        0u
#define TIME_COUNTER_UsingHWEnable              0u
#define TIME_COUNTER_EnableTriggerMode          0u
#define TIME_COUNTER_InterruptOnCaptureCount    0u
#define TIME_COUNTER_RunModeUsed                0u
#define TIME_COUNTER_ControlRegRemoved          0u

#if defined(TIME_COUNTER_TimerUDB_sCTRLReg_SyncCtl_ctrlreg__CONTROL_REG)
    #define TIME_COUNTER_UDB_CONTROL_REG_REMOVED            (0u)
#elif  (TIME_COUNTER_UsingFixedFunction)
    #define TIME_COUNTER_UDB_CONTROL_REG_REMOVED            (0u)
#else 
    #define TIME_COUNTER_UDB_CONTROL_REG_REMOVED            (1u)
#endif /* End TIME_COUNTER_TimerUDB_sCTRLReg_SyncCtl_ctrlreg__CONTROL_REG */


/***************************************
*       Type defines
***************************************/


/**************************************************************************
 * Sleep Wakeup Backup structure for Timer Component
 *************************************************************************/
typedef struct
{
    uint8 TimerEnableState;
    #if(!TIME_COUNTER_UsingFixedFunction)

        uint32 TimerUdb;
        uint8 InterruptMaskValue;
        #if (TIME_COUNTER_UsingHWCaptureCounter)
            uint8 TimerCaptureCounter;
        #endif /* variable declarations for backing up non retention registers in CY_UDB_V1 */

        #if (!TIME_COUNTER_UDB_CONTROL_REG_REMOVED)
            uint8 TimerControlRegister;
        #endif /* variable declaration for backing up enable state of the Timer */
    #endif /* define backup variables only for UDB implementation. Fixed function registers are all retention */

}TIME_COUNTER_backupStruct;


/***************************************
*       Function Prototypes
***************************************/

void    TIME_COUNTER_Start(void) ;
void    TIME_COUNTER_Stop(void) ;

void    TIME_COUNTER_SetInterruptMode(uint8 interruptMode) ;
uint8   TIME_COUNTER_ReadStatusRegister(void) ;
/* Deprecated function. Do not use this in future. Retained for backward compatibility */
#define TIME_COUNTER_GetInterruptSource() TIME_COUNTER_ReadStatusRegister()

#if(!TIME_COUNTER_UDB_CONTROL_REG_REMOVED)
    uint8   TIME_COUNTER_ReadControlRegister(void) ;
    void    TIME_COUNTER_WriteControlRegister(uint8 control) ;
#endif /* (!TIME_COUNTER_UDB_CONTROL_REG_REMOVED) */

uint32  TIME_COUNTER_ReadPeriod(void) ;
void    TIME_COUNTER_WritePeriod(uint32 period) ;
uint32  TIME_COUNTER_ReadCounter(void) ;
void    TIME_COUNTER_WriteCounter(uint32 counter) ;
uint32  TIME_COUNTER_ReadCapture(void) ;
void    TIME_COUNTER_SoftwareCapture(void) ;

#if(!TIME_COUNTER_UsingFixedFunction) /* UDB Prototypes */
    #if (TIME_COUNTER_SoftwareCaptureMode)
        void    TIME_COUNTER_SetCaptureMode(uint8 captureMode) ;
    #endif /* (!TIME_COUNTER_UsingFixedFunction) */

    #if (TIME_COUNTER_SoftwareTriggerMode)
        void    TIME_COUNTER_SetTriggerMode(uint8 triggerMode) ;
    #endif /* (TIME_COUNTER_SoftwareTriggerMode) */

    #if (TIME_COUNTER_EnableTriggerMode)
        void    TIME_COUNTER_EnableTrigger(void) ;
        void    TIME_COUNTER_DisableTrigger(void) ;
    #endif /* (TIME_COUNTER_EnableTriggerMode) */


    #if(TIME_COUNTER_InterruptOnCaptureCount)
        void    TIME_COUNTER_SetInterruptCount(uint8 interruptCount) ;
    #endif /* (TIME_COUNTER_InterruptOnCaptureCount) */

    #if (TIME_COUNTER_UsingHWCaptureCounter)
        void    TIME_COUNTER_SetCaptureCount(uint8 captureCount) ;
        uint8   TIME_COUNTER_ReadCaptureCount(void) ;
    #endif /* (TIME_COUNTER_UsingHWCaptureCounter) */

    void TIME_COUNTER_ClearFIFO(void) ;
#endif /* UDB Prototypes */

/* Sleep Retention APIs */
void TIME_COUNTER_Init(void)          ;
void TIME_COUNTER_Enable(void)        ;
void TIME_COUNTER_SaveConfig(void)    ;
void TIME_COUNTER_RestoreConfig(void) ;
void TIME_COUNTER_Sleep(void)         ;
void TIME_COUNTER_Wakeup(void)        ;


/***************************************
*   Enumerated Types and Parameters
***************************************/

/* Enumerated Type B_Timer__CaptureModes, Used in Capture Mode */
#define TIME_COUNTER__B_TIMER__CM_NONE 0
#define TIME_COUNTER__B_TIMER__CM_RISINGEDGE 1
#define TIME_COUNTER__B_TIMER__CM_FALLINGEDGE 2
#define TIME_COUNTER__B_TIMER__CM_EITHEREDGE 3
#define TIME_COUNTER__B_TIMER__CM_SOFTWARE 4



/* Enumerated Type B_Timer__TriggerModes, Used in Trigger Mode */
#define TIME_COUNTER__B_TIMER__TM_NONE 0x00u
#define TIME_COUNTER__B_TIMER__TM_RISINGEDGE 0x04u
#define TIME_COUNTER__B_TIMER__TM_FALLINGEDGE 0x08u
#define TIME_COUNTER__B_TIMER__TM_EITHEREDGE 0x0Cu
#define TIME_COUNTER__B_TIMER__TM_SOFTWARE 0x10u


