cduarte0306/RC-Car-peripheral-controller/src/rc-car-peripheral-controller/rc-car-peripheral-controller.cydsn/Generated_Source/PSoC5/TIME_COUNTER.h
/***************************************
*    Initialial Parameter Constants
***************************************/

#define TIME_COUNTER_INIT_PERIOD             255u
#define TIME_COUNTER_INIT_CAPTURE_MODE       ((uint8)((uint8)0u << TIME_COUNTER_CTRL_CAP_MODE_SHIFT))
#define TIME_COUNTER_INIT_TRIGGER_MODE       ((uint8)((uint8)0u << TIME_COUNTER_CTRL_TRIG_MODE_SHIFT))
#if (TIME_COUNTER_UsingFixedFunction)
    #define TIME_COUNTER_INIT_INTERRUPT_MODE (((uint8)((uint8)0u << TIME_COUNTER_STATUS_TC_INT_MASK_SHIFT)) | \
                                                  ((uint8)((uint8)0 << TIME_COUNTER_STATUS_CAPTURE_INT_MASK_SHIFT)))
#else
    #define TIME_COUNTER_INIT_INTERRUPT_MODE (((uint8)((uint8)0u << TIME_COUNTER_STATUS_TC_INT_MASK_SHIFT)) | \
                                                 ((uint8)((uint8)0 << TIME_COUNTER_STATUS_CAPTURE_INT_MASK_SHIFT)) | \
                                                 ((uint8)((uint8)0 << TIME_COUNTER_STATUS_FIFOFULL_INT_MASK_SHIFT)))
#endif /* (TIME_COUNTER_UsingFixedFunction) */
#define TIME_COUNTER_INIT_CAPTURE_COUNT      (2u)
#define TIME_COUNTER_INIT_INT_CAPTURE_COUNT  ((uint8)((uint8)(1u - 1u) << TIME_COUNTER_CTRL_INTCNT_SHIFT))


/***************************************
*           Registers
***************************************/

#if (TIME_COUNTER_UsingFixedFunction) /* Implementation Specific Registers and Register Constants */


    /***************************************
    *    Fixed Function Registers
    ***************************************/

    #define TIME_COUNTER_STATUS         (*(reg8 *) TIME_COUNTER_TimerHW__SR0 )
    /* In Fixed Function Block Status and Mask are the same register */
    #define TIME_COUNTER_STATUS_MASK    (*(reg8 *) TIME_COUNTER_TimerHW__SR0 )
    #define TIME_COUNTER_CONTROL        (*(reg8 *) TIME_COUNTER_TimerHW__CFG0)
    #define TIME_COUNTER_CONTROL2       (*(reg8 *) TIME_COUNTER_TimerHW__CFG1)
    #define TIME_COUNTER_CONTROL2_PTR   ( (reg8 *) TIME_COUNTER_TimerHW__CFG1)
    #define TIME_COUNTER_RT1            (*(reg8 *) TIME_COUNTER_TimerHW__RT1)
    #define TIME_COUNTER_RT1_PTR        ( (reg8 *) TIME_COUNTER_TimerHW__RT1)

    #if (CY_PSOC3 || CY_PSOC5LP)
        #define TIME_COUNTER_CONTROL3       (*(reg8 *) TIME_COUNTER_TimerHW__CFG2)
        #define TIME_COUNTER_CONTROL3_PTR   ( (reg8 *) TIME_COUNTER_TimerHW__CFG2)
    #endif /* (CY_PSOC3 || CY_PSOC5LP) */
    #define TIME_COUNTER_GLOBAL_ENABLE  (*(reg8 *) TIME_COUNTER_TimerHW__PM_ACT_CFG)
    #define TIME_COUNTER_GLOBAL_STBY_ENABLE  (*(reg8 *) TIME_COUNTER_TimerHW__PM_STBY_CFG)

    #define TIME_COUNTER_CAPTURE_LSB         (* (reg16 *) TIME_COUNTER_TimerHW__CAP0 )
    #define TIME_COUNTER_CAPTURE_LSB_PTR       ((reg16 *) TIME_COUNTER_TimerHW__CAP0 )
    #define TIME_COUNTER_PERIOD_LSB          (* (reg16 *) TIME_COUNTER_TimerHW__PER0 )
    #define TIME_COUNTER_PERIOD_LSB_PTR        ((reg16 *) TIME_COUNTER_TimerHW__PER0 )
    #define TIME_COUNTER_COUNTER_LSB         (* (reg16 *) TIME_COUNTER_TimerHW__CNT_CMP0 )
    #define TIME_COUNTER_COUNTER_LSB_PTR       ((reg16 *) TIME_COUNTER_TimerHW__CNT_CMP0 )


    /***************************************
    *    Register Constants
    ***************************************/

    /* Fixed Function Block Chosen */
    #define TIME_COUNTER_BLOCK_EN_MASK                     TIME_COUNTER_TimerHW__PM_ACT_MSK
    #define TIME_COUNTER_BLOCK_STBY_EN_MASK                TIME_COUNTER_TimerHW__PM_STBY_MSK

    /* Control Register Bit Locations */
    /* Interrupt Count - Not valid for Fixed Function Block */
    #define TIME_COUNTER_CTRL_INTCNT_SHIFT                  0x00u
    /* Trigger Polarity - Not valid for Fixed Function Block */
    #define TIME_COUNTER_CTRL_TRIG_MODE_SHIFT               0x00u
    /* Trigger Enable - Not valid for Fixed Function Block */
    #define TIME_COUNTER_CTRL_TRIG_EN_SHIFT                 0x00u
    /* Capture Polarity - Not valid for Fixed Function Block */
    #define TIME_COUNTER_CTRL_CAP_MODE_SHIFT                0x00u
    /* Timer Enable - As defined in Register Map, part of TMRX_CFG0 register */
    #define TIME_COUNTER_CTRL_ENABLE_SHIFT                  0x00u

    /* Control Register Bit Masks */
    #define TIME_COUNTER_CTRL_ENABLE                        ((uint8)((uint8)0x01u << TIME_COUNTER_CTRL_ENABLE_SHIFT))

    /* Control2 Register Bit Masks */
    /* As defined in Register Map, Part of the TMRX_CFG1 register */
    #define TIME_COUNTER_CTRL2_IRQ_SEL_SHIFT                 0x00u
    #define TIME_COUNTER_CTRL2_IRQ_SEL                      ((uint8)((uint8)0x01u << TIME_COUNTER_CTRL2_IRQ_SEL_SHIFT))

    #if (CY_PSOC5A)
        /* Use CFG1 Mode bits to set run mode */
        /* As defined by Verilog Implementation */
        #define TIME_COUNTER_CTRL_MODE_SHIFT                 0x01u
        #define TIME_COUNTER_CTRL_MODE_MASK                 ((uint8)((uint8)0x07u << TIME_COUNTER_CTRL_MODE_SHIFT))
    #endif /* (CY_PSOC5A) */
    #if (CY_PSOC3 || CY_PSOC5LP)
        /* Control3 Register Bit Locations */
        #define TIME_COUNTER_CTRL_RCOD_SHIFT        0x02u
        #define TIME_COUNTER_CTRL_ENBL_SHIFT        0x00u
        #define TIME_COUNTER_CTRL_MODE_SHIFT        0x00u

        /* Control3 Register Bit Masks */
        #define TIME_COUNTER_CTRL_RCOD_MASK  ((uint8)((uint8)0x03u << TIME_COUNTER_CTRL_RCOD_SHIFT)) /* ROD and COD bit masks */
        #define TIME_COUNTER_CTRL_ENBL_MASK  ((uint8)((uint8)0x80u << TIME_COUNTER_CTRL_ENBL_SHIFT)) /* HW_EN bit mask */
        #define TIME_COUNTER_CTRL_MODE_MASK  ((uint8)((uint8)0x03u << TIME_COUNTER_CTRL_MODE_SHIFT)) /* Run mode bit mask */

        #define TIME_COUNTER_CTRL_RCOD       ((uint8)((uint8)0x03u << TIME_COUNTER_CTRL_RCOD_SHIFT))
        #define TIME_COUNTER_CTRL_ENBL       ((uint8)((uint8)0x80u << TIME_COUNTER_CTRL_ENBL_SHIFT))
    #endif /* (CY_PSOC3 || CY_PSOC5LP) */

    /*RT1 Synch Constants: Applicable for PSoC3 and PSoC5LP */
    #define TIME_COUNTER_RT1_SHIFT                       0x04u
    /* Sync TC and CMP bit masks */
    #define TIME_COUNTER_RT1_MASK                        ((uint8)((uint8)0x03u << TIME_COUNTER_RT1_SHIFT))
    #define TIME_COUNTER_SYNC                            ((uint8)((uint8)0x03u << TIME_COUNTER_RT1_SHIFT))
    #define TIME_COUNTER_SYNCDSI_SHIFT                   0x00u
    /* Sync all DSI inputs with Mask  */
    #define TIME_COUNTER_SYNCDSI_MASK                    ((uint8)((uint8)0x0Fu << TIME_COUNTER_SYNCDSI_SHIFT))
    /* Sync all DSI inputs */
    #define TIME_COUNTER_SYNCDSI_EN                      ((uint8)((uint8)0x0Fu << TIME_COUNTER_SYNCDSI_SHIFT))

    #define TIME_COUNTER_CTRL_MODE_PULSEWIDTH            ((uint8)((uint8)0x01u << TIME_COUNTER_CTRL_MODE_SHIFT))
    #define TIME_COUNTER_CTRL_MODE_PERIOD                ((uint8)((uint8)0x02u << TIME_COUNTER_CTRL_MODE_SHIFT))
    #define TIME_COUNTER_CTRL_MODE_CONTINUOUS            ((uint8)((uint8)0x00u << TIME_COUNTER_CTRL_MODE_SHIFT))

    /* Status Register Bit Locations */
    /* As defined in Register Map, part of TMRX_SR0 register */
    #define TIME_COUNTER_STATUS_TC_SHIFT                 0x07u
    /* As defined in Register Map, part of TMRX_SR0 register, Shared with Compare Status */
    #define TIME_COUNTER_STATUS_CAPTURE_SHIFT            0x06u
    /* As defined in Register Map, part of TMRX_SR0 register */
    #define TIME_COUNTER_STATUS_TC_INT_MASK_SHIFT        (TIME_COUNTER_STATUS_TC_SHIFT - 0x04u)
    /* As defined in Register Map, part of TMRX_SR0 register, Shared with Compare Status */
    #define TIME_COUNTER_STATUS_CAPTURE_INT_MASK_SHIFT   (TIME_COUNTER_STATUS_CAPTURE_SHIFT - 0x04u)

    /* Status Register Bit Masks */
    #define TIME_COUNTER_STATUS_TC                       ((uint8)((uint8)0x01u << TIME_COUNTER_STATUS_TC_SHIFT))
    #define TIME_COUNTER_STATUS_CAPTURE                  ((uint8)((uint8)0x01u << TIME_COUNTER_STATUS_CAPTURE_SHIFT))
    /* Interrupt Enable Bit-Mask for interrupt on TC */
    #define TIME_COUNTER_STATUS_TC_INT_MASK              ((uint8)((uint8)0x01u << TIME_COUNTER_STATUS_TC_INT_MASK_SHIFT))
    /* Interrupt Enable Bit-Mask for interrupt on Capture */
    #define TIME_COUNTER_STATUS_CAPTURE_INT_MASK         ((uint8)((uint8)0x01u << TIME_COUNTER_STATUS_CAPTURE_INT_MASK_SHIFT))

#else   /* UDB Registers and Register Constants */


