cduarte0306/RC-Car-peripheral-controller/src/rc-car-peripheral-controller/rc-car-peripheral-controller.cydsn/Generated_Source/PSoC5/TIME_COUNTER.h
    /***************************************
    *           UDB Registers
    ***************************************/

    #define TIME_COUNTER_STATUS              (* (reg8 *) TIME_COUNTER_TimerUDB_rstSts_stsreg__STATUS_REG )
    #define TIME_COUNTER_STATUS_MASK         (* (reg8 *) TIME_COUNTER_TimerUDB_rstSts_stsreg__MASK_REG)
    #define TIME_COUNTER_STATUS_AUX_CTRL     (* (reg8 *) TIME_COUNTER_TimerUDB_rstSts_stsreg__STATUS_AUX_CTL_REG)
    #define TIME_COUNTER_CONTROL             (* (reg8 *) TIME_COUNTER_TimerUDB_sCTRLReg_SyncCtl_ctrlreg__CONTROL_REG )
    
    #if(TIME_COUNTER_Resolution <= 8u) /* 8-bit Timer */
        #define TIME_COUNTER_CAPTURE_LSB         (* (reg8 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__F0_REG )
        #define TIME_COUNTER_CAPTURE_LSB_PTR       ((reg8 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__F0_REG )
        #define TIME_COUNTER_PERIOD_LSB          (* (reg8 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__D0_REG )
        #define TIME_COUNTER_PERIOD_LSB_PTR        ((reg8 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__D0_REG )
        #define TIME_COUNTER_COUNTER_LSB         (* (reg8 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__A0_REG )
        #define TIME_COUNTER_COUNTER_LSB_PTR       ((reg8 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__A0_REG )
    #elif(TIME_COUNTER_Resolution <= 16u) /* 8-bit Timer */
        #if(CY_PSOC3) /* 8-bit addres space */
            #define TIME_COUNTER_CAPTURE_LSB         (* (reg16 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__F0_REG )
            #define TIME_COUNTER_CAPTURE_LSB_PTR       ((reg16 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__F0_REG )
            #define TIME_COUNTER_PERIOD_LSB          (* (reg16 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__D0_REG )
            #define TIME_COUNTER_PERIOD_LSB_PTR        ((reg16 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__D0_REG )
            #define TIME_COUNTER_COUNTER_LSB         (* (reg16 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__A0_REG )
            #define TIME_COUNTER_COUNTER_LSB_PTR       ((reg16 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__A0_REG )
        #else /* 16-bit address space */
            #define TIME_COUNTER_CAPTURE_LSB         (* (reg16 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__16BIT_F0_REG )
            #define TIME_COUNTER_CAPTURE_LSB_PTR       ((reg16 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__16BIT_F0_REG )
            #define TIME_COUNTER_PERIOD_LSB          (* (reg16 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__16BIT_D0_REG )
            #define TIME_COUNTER_PERIOD_LSB_PTR        ((reg16 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__16BIT_D0_REG )
            #define TIME_COUNTER_COUNTER_LSB         (* (reg16 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__16BIT_A0_REG )
            #define TIME_COUNTER_COUNTER_LSB_PTR       ((reg16 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__16BIT_A0_REG )
        #endif /* CY_PSOC3 */
    #elif(TIME_COUNTER_Resolution <= 24u)/* 24-bit Timer */
        #define TIME_COUNTER_CAPTURE_LSB         (* (reg32 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__F0_REG )
        #define TIME_COUNTER_CAPTURE_LSB_PTR       ((reg32 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__F0_REG )
        #define TIME_COUNTER_PERIOD_LSB          (* (reg32 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__D0_REG )
        #define TIME_COUNTER_PERIOD_LSB_PTR        ((reg32 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__D0_REG )
        #define TIME_COUNTER_COUNTER_LSB         (* (reg32 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__A0_REG )
        #define TIME_COUNTER_COUNTER_LSB_PTR       ((reg32 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__A0_REG )
    #else /* 32-bit Timer */
        #if(CY_PSOC3 || CY_PSOC5) /* 8-bit address space */
            #define TIME_COUNTER_CAPTURE_LSB         (* (reg32 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__F0_REG )
            #define TIME_COUNTER_CAPTURE_LSB_PTR       ((reg32 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__F0_REG )
            #define TIME_COUNTER_PERIOD_LSB          (* (reg32 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__D0_REG )
            #define TIME_COUNTER_PERIOD_LSB_PTR        ((reg32 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__D0_REG )
            #define TIME_COUNTER_COUNTER_LSB         (* (reg32 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__A0_REG )
            #define TIME_COUNTER_COUNTER_LSB_PTR       ((reg32 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__A0_REG )
        #else /* 32-bit address space */
            #define TIME_COUNTER_CAPTURE_LSB         (* (reg32 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__32BIT_F0_REG )
            #define TIME_COUNTER_CAPTURE_LSB_PTR       ((reg32 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__32BIT_F0_REG )
            #define TIME_COUNTER_PERIOD_LSB          (* (reg32 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__32BIT_D0_REG )
            #define TIME_COUNTER_PERIOD_LSB_PTR        ((reg32 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__32BIT_D0_REG )
            #define TIME_COUNTER_COUNTER_LSB         (* (reg32 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__32BIT_A0_REG )
            #define TIME_COUNTER_COUNTER_LSB_PTR       ((reg32 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__32BIT_A0_REG )
        #endif /* CY_PSOC3 || CY_PSOC5 */ 
    #endif

    #define TIME_COUNTER_COUNTER_LSB_PTR_8BIT       ((reg8 *) TIME_COUNTER_TimerUDB_sT32_timerdp_u0__A0_REG )
    
    #if (TIME_COUNTER_UsingHWCaptureCounter)
        #define TIME_COUNTER_CAP_COUNT              (*(reg8 *) TIME_COUNTER_TimerUDB_sCapCount_counter__PERIOD_REG )
        #define TIME_COUNTER_CAP_COUNT_PTR          ( (reg8 *) TIME_COUNTER_TimerUDB_sCapCount_counter__PERIOD_REG )
        #define TIME_COUNTER_CAPTURE_COUNT_CTRL     (*(reg8 *) TIME_COUNTER_TimerUDB_sCapCount_counter__CONTROL_AUX_CTL_REG )
        #define TIME_COUNTER_CAPTURE_COUNT_CTRL_PTR ( (reg8 *) TIME_COUNTER_TimerUDB_sCapCount_counter__CONTROL_AUX_CTL_REG )
    #endif /* (TIME_COUNTER_UsingHWCaptureCounter) */


    /***************************************
    *       Register Constants
    ***************************************/

    /* Control Register Bit Locations */
    #define TIME_COUNTER_CTRL_INTCNT_SHIFT              0x00u       /* As defined by Verilog Implementation */
    #define TIME_COUNTER_CTRL_TRIG_MODE_SHIFT           0x02u       /* As defined by Verilog Implementation */
    #define TIME_COUNTER_CTRL_TRIG_EN_SHIFT             0x04u       /* As defined by Verilog Implementation */
    #define TIME_COUNTER_CTRL_CAP_MODE_SHIFT            0x05u       /* As defined by Verilog Implementation */
    #define TIME_COUNTER_CTRL_ENABLE_SHIFT              0x07u       /* As defined by Verilog Implementation */

    /* Control Register Bit Masks */
    #define TIME_COUNTER_CTRL_INTCNT_MASK               ((uint8)((uint8)0x03u << TIME_COUNTER_CTRL_INTCNT_SHIFT))
    #define TIME_COUNTER_CTRL_TRIG_MODE_MASK            ((uint8)((uint8)0x03u << TIME_COUNTER_CTRL_TRIG_MODE_SHIFT))
    #define TIME_COUNTER_CTRL_TRIG_EN                   ((uint8)((uint8)0x01u << TIME_COUNTER_CTRL_TRIG_EN_SHIFT))
    #define TIME_COUNTER_CTRL_CAP_MODE_MASK             ((uint8)((uint8)0x03u << TIME_COUNTER_CTRL_CAP_MODE_SHIFT))
    #define TIME_COUNTER_CTRL_ENABLE                    ((uint8)((uint8)0x01u << TIME_COUNTER_CTRL_ENABLE_SHIFT))

