cduarte0306/RC-Car-peripheral-controller/src/rc-car-peripheral-controller/rc-car-peripheral-controller.cydsn/Generated_Source/PSoC5/TIME_COUNTER.h
    /* Bit Counter (7-bit) Control Register Bit Definitions */
    /* As defined by the Register map for the AUX Control Register */
    #define TIME_COUNTER_CNTR_ENABLE                    0x20u

    /* Status Register Bit Locations */
    #define TIME_COUNTER_STATUS_TC_SHIFT                0x00u  /* As defined by Verilog Implementation */
    #define TIME_COUNTER_STATUS_CAPTURE_SHIFT           0x01u  /* As defined by Verilog Implementation */
    #define TIME_COUNTER_STATUS_TC_INT_MASK_SHIFT       TIME_COUNTER_STATUS_TC_SHIFT
    #define TIME_COUNTER_STATUS_CAPTURE_INT_MASK_SHIFT  TIME_COUNTER_STATUS_CAPTURE_SHIFT
    #define TIME_COUNTER_STATUS_FIFOFULL_SHIFT          0x02u  /* As defined by Verilog Implementation */
    #define TIME_COUNTER_STATUS_FIFONEMP_SHIFT          0x03u  /* As defined by Verilog Implementation */
    #define TIME_COUNTER_STATUS_FIFOFULL_INT_MASK_SHIFT TIME_COUNTER_STATUS_FIFOFULL_SHIFT

    /* Status Register Bit Masks */
    /* Sticky TC Event Bit-Mask */
    #define TIME_COUNTER_STATUS_TC                      ((uint8)((uint8)0x01u << TIME_COUNTER_STATUS_TC_SHIFT))
    /* Sticky Capture Event Bit-Mask */
    #define TIME_COUNTER_STATUS_CAPTURE                 ((uint8)((uint8)0x01u << TIME_COUNTER_STATUS_CAPTURE_SHIFT))
    /* Interrupt Enable Bit-Mask */
    #define TIME_COUNTER_STATUS_TC_INT_MASK             ((uint8)((uint8)0x01u << TIME_COUNTER_STATUS_TC_SHIFT))
    /* Interrupt Enable Bit-Mask */
    #define TIME_COUNTER_STATUS_CAPTURE_INT_MASK        ((uint8)((uint8)0x01u << TIME_COUNTER_STATUS_CAPTURE_SHIFT))
    /* NOT-Sticky FIFO Full Bit-Mask */
    #define TIME_COUNTER_STATUS_FIFOFULL                ((uint8)((uint8)0x01u << TIME_COUNTER_STATUS_FIFOFULL_SHIFT))
    /* NOT-Sticky FIFO Not Empty Bit-Mask */
    #define TIME_COUNTER_STATUS_FIFONEMP                ((uint8)((uint8)0x01u << TIME_COUNTER_STATUS_FIFONEMP_SHIFT))
    /* Interrupt Enable Bit-Mask */
    #define TIME_COUNTER_STATUS_FIFOFULL_INT_MASK       ((uint8)((uint8)0x01u << TIME_COUNTER_STATUS_FIFOFULL_SHIFT))

    #define TIME_COUNTER_STATUS_ACTL_INT_EN             0x10u   /* As defined for the ACTL Register */

    /* Datapath Auxillary Control Register definitions */
    #define TIME_COUNTER_AUX_CTRL_FIFO0_CLR             0x01u   /* As defined by Register map */
    #define TIME_COUNTER_AUX_CTRL_FIFO1_CLR             0x02u   /* As defined by Register map */
    #define TIME_COUNTER_AUX_CTRL_FIFO0_LVL             0x04u   /* As defined by Register map */
    #define TIME_COUNTER_AUX_CTRL_FIFO1_LVL             0x08u   /* As defined by Register map */
    #define TIME_COUNTER_STATUS_ACTL_INT_EN_MASK        0x10u   /* As defined for the ACTL Register */

#endif /* Implementation Specific Registers and Register Constants */

#endif  /* CY_TIMER_TIME_COUNTER_H */


/* [] END OF FILE */
